Repository: davidfayez/Medical-Optics
Catalog: src/Application/Common/Resources/ErrorMessages.*.resx
Languages: ar

source: Account code not found
ar: كود الحساب غير موجود

# AllVoucherMustBePosted
source: All voucher must be posted before closing financial period
ar: لاغلاق السنة المالية يجب ان تكون جميع القيود مرحلة

source: Charachters only
ar: مسموح بحروف فقط

# ChooseAccount
source: Please choose account
ar: يجب اختيار حساب

# ChooseAccountOrCostCenter
source: Please choose account or costcenter
ar: يجب اختيار حساب او مركز تكلفه

# ChooseCostCenter
source: Please choose costcenter
ar: يجب اختيار مركز تكلفه

# ChooseDateInCurrenetFinanicalPeriod
source: Please enter date in current financial period
ar: إختر تاريخ داخل الفترة المالية

source: Code already exist
ar: الكود موجود بالفعل

source: Code example
ar: الكود يجب ان يكون على الشكل

source: Company branch not exist
ar: يجب ادخال فرع الشركه

source: costcenter code not Found
ar: كود مركز التكلفه غير موجود

# DataNotCompleted
source: Incomplete data
ar: البيانات غير مكتملة

source: Data not found
ar: لم يتم العثور على بيانات

source: Debit Required
ar: يجب ادخال قيمه المدين

# DecimalNotValid
source: Please enter number like the example ###.##
ar: الرجاء إدخال رقم صحيح على سبيل المثال ###.##

# DefaultErrorMessage
source: Error , Please contact Technical support
ar: حدث خطأ غير متوقع ، يرجى الاتصال بالمشرف

# DuplicateEmail
source: Email already exist
ar: البريد الإلكتروني مستخدم

# DuplicateName
source: Name already exist
ar: الاسم مستخدم

# EmailNotValid
source: Please enter email like the example : username@example.com.
ar: يرجى إدخال عنوان بريد إلكتروني صالح على سبيل المثال: : username@example.com.

# EndDateAndNumberOfRecurrenceNotExist
source: Please enter number of repeted ,or repeate end date
ar: يجب ادخال عدد مرات التكرار او تاريخ نهاية التكرار

# ErrorMsg
source: Error ,Please try again
ar: حدث خطأ ما. أعد المحاولة من فضلك

# EveryNumberOfDaysNotExist
source: Please enter total for number of days
ar: يجب ادخال قيمه كل عدد ايام

# FreezingReasonMsg
source: Please enter freezing reason
ar: يجب اختيار سبب التجميد

# fromzeroto100
source: Number must be between 0 - 100 ###.##
ar: يجب أن تكون القيمة أكبر من 0 وأقل من 100 مع 2 منزلة عشرية على سبيل المثال ###.##

# FutureDateNotAllowed
source: Entered date can't be bigger than current date
ar: يجب ألا يتجاوز التاريخ التاريخ الحالي

# GlJournalVoucherCategoryNotExist
source: Please select voucher type
ar: يجب ان تختار نوع القيد

# GridLengthZero
source: You must have at least on row
ar: يجب إدخال صف واحد على الأقل

# GridLengthZeroChoose
source: You must choose at least on row
ar: يجب اختيار صف واحد على الأقل

source: Incorrect Password
ar: كلمة سر خاطئة

source: Invalid Date
ar: تاريخ غير صالح

source: Invalid Fax
ar: رقم الفاكس غير صحيح

# InvalidFaxLength
source: Length between 10-15
ar: من 10 الي 15 خانة

source: Invalid Identification Number
ar: رقم الهوية غير صحيح

# InvalidIdentificationNumberLength
source: Length between 10-20
ar: من 10 الي 20 خانة

source: Invalid Image
ar: ملف غير صالح

# InvalidMobile
source: Invalid Mobile Number
ar: رقم الجوال غير صالح

# InvalidMobileLength
source: Length between 10-15
ar: من 10 الي 15 خانة

source: Invalid Number
ar: تأكد من إدخال رقم صحيح

source: Invalid Phone
ar: رقم التليفون غير صالح

# InvalidPhoneLength
source: Length between 10-15
ar: من 10 الي 15 خانة

source: Link Not Valid
ar: الرجاء إدخال رابط صالح

source: Mail Not Valid
ar: يرجى إدخال بريد الكترونى سليم

# MaxAllowedFileSizeMsg
source: Max Allowed File Size 10 mb
ar: اقصي حجم مسموح به 10 ميجابايت

# MaxAllowedMargin
source: Please enter number like the example ###.##
ar: الرجاء إدخال رقم صحيح على سبيل المثال ###. ##

# MaxLength1000NotValid
source: Max length is 1000 character
ar: الحد الاقصي 1000 حرف

# MaxLength50NotValid
source: Max length is 50 character
ar: الحد الاقصي 50 حرف

# MaxLengthNotValid
source: Max length is 100 character
ar: الحد الاقصي 100 حرف

# MinLengthNotValid
source: Min length is 6 character
ar: الحد الادني 6 حرف

source: Mustadd financial period first
ar: يجب اضافة فترات مالية اولا

# NegativeQty
source: Negative not allowed
ar: كمية سالبة غير مسموح بها

# NoCodingCreated
source: Error ,No coding created
ar: حدث خطأ . يجب إدخال الترميز الخاص أولا

# NoEmployeeAvailable
source: You have to register employee before you can create user
ar: يجب تسجيل بيانات الموظف اولا لتتمكن من انشاء مستخدم

# NoFileSelectedMsg
source: No File Selected
ar: لم يتم اختيار اي ملف

# NoItemsSelected
source: Select
ar: اختر

source: Not Allowed Date
ar: تاريخ غير مسموح به

# NotificationPeriodNotExist
source: Please enter notification dates
ar: يجب ادخال عدد ايام التذكير قبل

source: Numbers Only
ar: مسموح بأرقام فقط

# PasswordConfirmMsg
source: Password and confirm password not matched
ar: كلمة السر و توكيدها غير متطابقتين

# PasswordMismach
source: Password and confirm password not matched
ar: كلمة المرور وتأكيد كلمة المرور غير متطابقين

# PasswordValidation
source: Password min length 6 character and you must have small ,capital,number and special character
ar: يجب ألا يقل طول كلمة المرور عن ستة أحرف و يجب ان تحتوي حروف كبيرة وصغيرة وارقام وعلامات خاصه

source: Payment Schedule Found
ar: هناك دفعات

# PaymentScheduleFoundMsg
source: ther is payment founded ,are you sure you want delete it?
ar: هناك دفعات فى هذا السجل ، هل أنت متأكد من أنك تريد حذفه ؟

# PercentageValueNotValid
source: Percentage between 1-100
ar: النسبة بين 1 و 100 ولا يمكن أن تحتوي على أكثر من رقمين عشريين

# QtyNotNumber
source: Numbers Only
ar: مسموح بأرقام فقط

# RateNotNumber
source: Rate must be number
ar: المعامل يجب ان يكون رقم

# RceBondTypeNotExist
source: Bond type not exist
ar: نوع السند غير موجود

source: Required *
ar: حقل مطلوب *

# RequiredCredit
source: Credit Required *
ar: حقل الدائن مطلوب *

# RequiredDebit
source: Debit Required*
ar: حقل المدين مطلوب *

# RequiredMessage
source: Please Enter {0}
ar: من فضلك ادخل {0}

# StartDateNotExistResource
source: You must enter start repetition date
ar: يجب ادخال تاريخ بداية التكرار

# TaxesPeriodNotExist
source: Please select tax period
ar: يجب ان تختار الفترة الضريبية

# TotalDebitNotEqualTotalCredit
source: credit and debit must be equal
ar: يجب ان تكون قيمة مجموع الدائن تساوي قيمة مجموع المدين

# UnauthorizedUserMessage
source: Unauthorized User
ar: مستخدم غير مصرح به

# UserNameValidation
source: Invalid user name,user name can have character and numbers only
ar: اسم المستخدم غير صالح ، يمكن أن يحتوي على أحرف أو أرقام فقط

# UserOrRoleNotExist
source: Must have at least one role
ar: يجب ادخال مستخدم واحد وصلاحية واحدة علي الاقل

# Waitingmsg
source: Please wait ...
ar: يرجى الانتظار حتى اكتمال طلبك ..

# WhiteSpaceNotAllowed
source: Spaces not allowed
ar: غير مسموح بوجود مسافات فارغة

# ZeroQuantity
source: Please enter number equal to or bigger than 0
ar: الرجاء إدخال قيمة أكبر من أو تساوي 0
